tests/performance/results/Transaksi/TC03 summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
[TC03] Step 1: GET /login,50,871,17,2670,888.13,0.000%,1.56597,7.61,0.39,4979.0
[TC03] Step 2: POST /login,50,1056,101,4482,1185.87,0.000%,1.55506,32.71,3.23,21537.0
[TC03] DB READ: GET /transaksi (SELECT + JOIN + Paginate),50,285,27,2652,597.87,0.000%,1.55598,158.80,1.50,104506.0
[TC03] DB READ 2: GET /transaksi?search (WHERE LIKE + JOIN),50,477,25,2664,856.97,0.000%,1.55686,105.89,1.52,69647.0
[TC03] DB WRITE: POST /transaksi (INSERT Transaction),50,895,49,4398,1225.27,0.000%,1.55870,163.69,3.36,107540.0
TOTAL,250,717,17,4482,1020.10,0.000%,7.46759,449.53,9.60,61641.8